app/controllers/api/v1/projects_controller.rb

  def index
    @projects = current_user.projects.all.reverse
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]

  def create
    @project = current_user.projects.create(project_params)
---
INSERT INTO "projects" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Project"], ["user_id", 1], ["created_at", 2017-05-13 10:50:43 UTC], ["updated_at", 2017-05-13 10:50:43 UTC]]

  def update
    project_updated = @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "New Project"], ["updated_at", 2017-05-13 14:26:57 UTC], ["id", 1]]

  def destroy
    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]

  def find_project
    @project = current_user.projects.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]