app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 ORDER BY "tasks"."position" ASC  [["project_id", 1]]
---
  def index
    @tasks = @project.tasks.all.order(:position)

INSERT INTO "tasks" ("name", "project_id", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New Task"], ["project_id", 1], ["position", 0], ["created_at", 2017-05-13 14:53:20 UTC], ["updated_at", 2017-05-13 14:53:20 UTC]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 1]]
UPDATE "tasks" SET "position" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["position", 1], ["updated_at", 2017-05-13 14:53:20 UTC], ["id", 1]]
---
  def create
    @task = @project.tasks.create(task_params)
    if @task.persisted?
      @project.tasks.each do |t|
        t.update(position: t.position + 1)

UPDATE "tasks" SET "deadline" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["deadline", "31.12.2017"], ["updated_at", 2017-05-16 22:58:22 UTC], ["id", 1]]
---
  def update
    task_updated = @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
  def destroy
    @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["project_id", 1], ["id", 0], ["LIMIT", 1]]
UPDATE "tasks" SET "position" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["position", 4], ["updated_at", 2017-05-15 18:26:50 UTC], ["id", 1]]
---
  def sort
    params[:order].each do |k,v|
      @project.tasks.find(k).update(position: v)

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def find_project
    @project = current_user.projects.find(params[:project_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["project_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def find_task
    @task = @project.tasks.find(params[:id])